app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "body", "created_at", "updated_at", "published_at") VALUES (?, ?, ?, ?, ?)  [["title", "Sunglasses"], ["body", "<div>Shades</div>"], ["created_at", "2024-03-27 12:02:57.877728"], ["updated_at", "2024-03-27 12:02:57.877728"], ["published_at", nil]]
---
  def create
    @post = Post.new(post_params)
    if @post.save

UPDATE "posts" SET "updated_at" = ?, "published_at" = ? WHERE "posts"."id" = ?  [["updated_at", "2024-03-26 17:38:39.796288"], ["published_at", "2024-06-15 00:00:00"], ["id", 3]]
---
  def update
    if @post.update(post_params)

SELECT "posts".* FROM "posts" WHERE (published_at <= '2024-03-26 15:38:07.477113') AND "posts"."id" = ? LIMIT ?  [["id", 17], ["LIMIT", 1]]
---
  def set_post
    @post = user_signed_in? ? Post.find(params[:id]) : Post.published.find(params[:id])